Catalogs/бит_ШаблоныСметы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ШаблоныСметы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_СтатьиОборотов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_СтатьиОборотов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасходДоход</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РасходДоход</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидСтатьи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ВидыСтатейОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_СтатьиШаблонаСметы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_СтатьиШаблонаСметы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.бит_ШаблоныСметы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СтатьяОборотов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатьиОборотов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кодификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_ШаблоныСметы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ПроцедурыИФункцииОбщегоНазначения

// БИТ_ЖКХ 30.08.2012 
// Процедура проверяет записан ли элемент справочника , если он новый.
// Перед началом добавления строк в табличные части.
//
// Возращаемое значение:
//   Булево - разрешено добавлять элементы в табличное поле.
//
&НаКлиенте
Функция ПроверитьВозможностьДобавленияЭлементов()
	
	Если Параметры.Ключ.Пустая() Тогда
		
		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Сначала необходимо записать элемент!");
		
		Разрешено = Ложь;
		
	Иначе	
		
		Разрешено = Истина;
		
	КонецЕсли;
	
	Возврат Разрешено;
	
КонецФункции // ПроверитьВозможностьДобавленияЭлементов()

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отбор = СтатьиСметы.Отбор.Элементы;
	
	ОтборПоВладельцу = Отбор.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборПоВладельцу.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Владелец");
	ОтборПоВладельцу.ПравоеЗначение = Объект.Ссылка;
	ОтборПоВладельцу.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
	ОтборПоВладельцу.Использование  = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ИсточникВыбора.ИмяФормы = "Справочник.бит_СтатьиОборотов.Форма.ФормаВыбораГруппы" Тогда
		
		ЗаполнитьСтатьиСметы(ВыбранноеЗначение, Объект.Ссылка);
		
		Элементы.СтатьиСметы.Обновить();
		
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыДействияКомандФормы

&НаКлиенте
Процедура Подбор(Команда)
	
	Разрешено = ПроверитьВозможностьДобавленияЭлементов();
	Если Не Разрешено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", Ложь);
	
	ОткрытьФорму("Справочник.бит_СтатьиОборотов.Форма.ФормаВыбора", ПараметрыФормы, Элементы.СтатьиСметы,,,, Новый ОписаниеОповещения("ПодборЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодборЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Завершение = Истина;	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГруппеСтатейОборотов(Команда)
	
	Разрешено = ПроверитьВозможностьДобавленияЭлементов();
	Если Не Разрешено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("Справочник.бит_СтатьиОборотов.Форма.ФормаВыбораГруппы", , ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область ПроцедурыОбработчикиСобытийТабличногоПоляСтатьиСметы

&НаКлиенте
Процедура СтатьиСметыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Разрешено = ПроверитьВозможностьДобавленияЭлементов();
	Отказ = Не Разрешено;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьиСметыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если  ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.бит_СтатьиОборотов") Тогда
		
		СоздатьСтатьюСметы(ВыбранноеЗначение, Объект.Ссылка);
		
	КонецЕсли; 
	
	Элементы.СтатьиСметы.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура создаёт и записывает новую статью бюджета.
//
// Параметры:
//  СтатьяОборотов  - СправочникСсылка.бит_СтатьиОборотов.
//  Параметр2  	 	- СправочникСсылка.бит_Бюджеты.
//
&НаСерверебезКонтекста
Процедура СоздатьСтатьюСметы(СтатьяОборотов, Смета)
	
	// БИТ_ЖКХ_03102013_начало_изменения
	// НоваяСтатьяСметы = Справочники.бит_СтатьиСметы.СоздатьЭлемент();.
	НоваяСтатьяСметы = Справочники.бит_СтатьиШаблонаСметы.СоздатьЭлемент();
	// БИТ_ЖКХ_03102013_окончание_изменения
	
	НоваяСтатьяСметы.Владелец 		    = Смета;
	НоваяСтатьяСметы.СтатьяОборотов     = СтатьяОборотов;
	НоваяСтатьяСметы.Наименование 	    = СтатьяОборотов.Наименование;
	НоваяСтатьяСметы.НаименованиеПолное = СтатьяОборотов.НаименованиеПолное;
	НоваяСтатьяСметы.Кодификатор 	    = СтатьяОборотов.Кодификатор;
	
	НоваяСтатьяСметы.Записать();
	
КонецПроцедуры // СоздатьСтатьюБюджета(ВыбранноеЗначение)()

&НаСерверебезКонтекста
Процедура ЗаполнитьСтатьиСметы(ГруппаСтатейОборотов, Смета)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Родитель", ГруппаСтатейОборотов);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	бит_СтатьиОборотов.Ссылка КАК Ссылка,
	|	бит_СтатьиОборотов.ЭтоГруппа,
	|	бит_СтатьиОборотов.Наименование,
	|	бит_СтатьиОборотов.НаименованиеПолное,
	|	бит_СтатьиОборотов.Кодификатор,
	|	ЗНАЧЕНИЕ(Справочник.бит_СтатьиШаблонаСметы.ПустаяСсылка) КАК РодительСтатьиСметы
	|ИЗ
	|	Справочник.бит_СтатьиОборотов КАК бит_СтатьиОборотов
	|ГДЕ
	|	бит_СтатьиОборотов.Ссылка В ИЕРАРХИИ(&Родитель)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка ИЕРАРХИЯ";
	
	ДеревоРезультат = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	НачатьТранзакцию();
	
	ОбойтиИерархиюСтатейОборотов(ДеревоРезультат, Смета);
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

&НаСерверебезКонтекста
Процедура ОбойтиИерархиюСтатейОборотов(Дерево, Смета)
	
	Для каждого СтрокаТаблицы Из Дерево.Строки Цикл
		
		Если СтрокаТаблицы.ЭтоГруппа Тогда
			// БИТ_ЖКХ_03102013_начало_изменения
			// НоваяСтатьяСметы = Справочники.бит_СтатьиСметы.СоздатьГруппу();.
			НоваяСтатьяСметы = Справочники.бит_СтатьиШаблонаСметы.СоздатьГруппу();
			// БИТ_ЖКХ_03102013_окончание_изменения
		Иначе
			// БИТ_ЖКХ_03102013_начало_изменения
			// НоваяСтатьяСметы = Справочники.бит_СтатьиСметы.СоздатьГруппу();.
			НоваяСтатьяСметы = Справочники.бит_СтатьиШаблонаСметы.СоздатьЭлемент();
			// БИТ_ЖКХ_03102013_окончание_изменения
			НоваяСтатьяСметы.НаименованиеПолное = СтрокаТаблицы.НаименованиеПолное;
		КонецЕсли; 
		
		НоваяСтатьяСметы.Владелец       = Смета;
		НоваяСтатьяСметы.Кодификатор    = СтрокаТаблицы.Кодификатор;
		НоваяСтатьяСметы.Наименование   = СтрокаТаблицы.Наименование;
		НоваяСтатьяСметы.СтатьяОборотов = СтрокаТаблицы.Ссылка;
		
		Если НЕ СтрокаТаблицы.Родитель = Неопределено Тогда
			Если ЗначениеЗаполнено(СтрокаТаблицы.Родитель.РодительСтатьиСметы) 
				И СтрокаТаблицы.Родитель.РодительСтатьиСметы.ЭтоГруппа Тогда
				НоваяСтатьяСметы.Родитель = СтрокаТаблицы.Родитель.РодительСтатьиСметы;
			КонецЕсли;
		КонецЕсли; 
		
		ДействиеВыполнено = бит_ОбщегоНазначения.ЗаписатьСправочник(НоваяСтатьяСметы,,"Все");
		Если ДействиеВыполнено Тогда
			
			// Если запись выполнена - запомним приемник для последующего заполнения иерархии.
			СтрокаТаблицы.РодительСтатьиСметы = НоваяСтатьяСметы.Ссылка;
			
		КонецЕсли; 
		
		// Рекурсивный вызов.
		ОбойтиИерархиюСтатейОборотов(СтрокаТаблицы, Смета);
		
	КонецЦикла; 
	
КонецПроцедуры //ОбойтиИерархиюСтатейОборотов()

#КонецОбласти
